public_html/app/Http/Helpers/helpers.php

function getSectionData($slug){
    $data = SiteSections::where('key', $slug)->first();
---
select * from `site_sections` where `key` = 'campaigns' limit 1

function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `code` = 'en' limit 1
select * from `languages` where `status` = 1 limit 1