public_html/app/Http/Controllers/Admin/AdminRewardController.php

    public function index(Request $request){
    $query = Reward::query();

    if ($request->filled('search')) {
        $query->where('title', 'like', '%' . $request->search . '%')
            ->orWhere('description', 'like', '%' . $request->search . '%');
    }

    // Use withCount to count only claimed rewards
    $rewards = $query->select(
            'id',
            'title',
            'description',
            'min_donation',
            'discount_per_thousand',
            'voucher_code',
            'is_claimable'
        )
        ->withCount(['userRewards as claimed_count' => function ($query) {
            $query->where('is_claimed', true); // Count only claimed rewards
        }])
        ->orderBy('created_at', 'desc')
        ->paginate(10);
---
select `id`, `title`, `description`, `min_donation`, `discount_per_thousand`, `voucher_code`, `is_claimable`, (select count(*) from `user_rewards` where `rewards`.`id` = `user_rewards`.`reward_id` and `is_claimed` = 1) as `claimed_count` from `rewards` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `rewards`