public_html/app/Http/Controllers/Admin/DonationController.php

select * from `transactions` where `type` = 'donation' order by `id` desc limit 20 offset 0
select `id`, `firstname`, `email`, `username`, `mobile` from `users` where `users`.`id` in (3, 5)
select count(*) as aggregate from `transactions` where `type` = 'donation'
---
    public function index()
    {
        $page_title = __('All Logs');
        $transactions = Transaction::with(
            'user:id,firstname,email,username,mobile',
        )->where('type', 'donation')->orderBy('id', 'desc')->paginate(20);