public_html/app/Http/Controllers/Admin/EventController.php

    public function __construct()
    {
        $this->languages = Language::whereNot('code', LanguageConst::NOT_REMOVABLE)->get();
---
select * from `languages` where not `code` = 'en'

    public function index()
    {
        $page_title = __('Events');
        $languages = $this->languages;
        $data = Event::with('category:id,name')->orderBy('id', 'desc')->paginate();
        $allCategory = CategoryType::where('type', 2)->orderByDesc('id')->get();
---
select * from `events` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `events`
select * from `category_types` where `type` = 2 order by `id` desc

        }

        try {
            Event::create($validated);
---
insert into `events` (`details`, `category_id`, `title`, `tags`, `slug`, `created_at`, `admin_id`, `updated_at`) values ('{\"language\":{\"en\":{\"details\":\"<p>\ud83c\udf1f <strong>Donor of the Month<\/strong> \ud83c\udf1f &nbsp;<br>We extend our heartfelt gratitude to JE**A MA****O, our amazing Donor of the Month! Your generosity and support inspire us to continue making a difference. Thank you for being a shining example of kindness and compassion! \ud83d\udc96<\/p>\"},\"fil\":{\"details\":null}}}', '9', '{\"language\":{\"en\":{\"title\":\"Donor of the Month (November 2024)\"},\"fil\":{\"title\":null}}}', '{\"language\":{\"en\":{\"tags\":[\"DonorOfTheMonth\",\"November\"]}}}', 'donor-of-the-month-november-2024', '2024-12-08 09:33:20', 1, '2024-12-08 09:33:20')

    public function edit($id)
    {
        $page_title = __('Event Edit');
        $languages = $this->languages;
        $data = Event::with('category:id,name')->findOrFail($id);
        $allCategory = CategoryType::where('type', 2)->orderByDesc('id')->get();
---
select * from `events` where `events`.`id` = '7' limit 1
select * from `category_types` where `type` = 2 order by `id` desc

    public function update(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'category' => 'required',
            'target'   => 'required',
            'image'    => 'nullable|image|mimes:png,jpg,jpeg,svg,webp',
        ]);

        $details_field = [
            'details'     => "required|string"
        ];
        $title_filed = [
            'title'     => "required|string",
        ];
        $tags = [
            'tags'     => "required|array",
        ];

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput()->with('modal', 'event-edit');
        }
        $validated = $validator->validate();

        $event = Event::findOrFail($validated['target']);
---
select * from `events` where `events`.`id` = '7' limit 1

        }

        try {
            $event->update($validated);
---
update `events` set `details` = '{\"language\":{\"en\":{\"details\":\"<p>\ud83c\udf1f <strong>Donor of the Month<\/strong> \ud83c\udf1f &nbsp;<br>We extend our heartfelt gratitude to JE**A MA****O, our amazing Donor of the Month! Your generosity and support inspire us to continue making a difference. Thank you for being a shining example of kindness and compassion! \ud83d\udc96<\/p>\"},\"fil\":{\"details\":\"<p>\ud83c\udf1f Donor ng Buwan \ud83c\udf1f &nbsp;<br>Ipinaaabot namin ang aming taos-pusong pasasalamat kay JE**A MA****O, ang aming kamangha-manghang Donor ng Buwan! Ang iyong pagkabukas-palad at suporta ay nagbibigay-inspirasyon sa amin na magpatuloy sa paggawa ng pagbabago. Salamat sa pagiging isang maningning na halimbawa ng kabaitan at pakikiramay! \ud83d\udc96<\/p>\"}}}', `created_at` = '2024-12-08 09:47:51', `events`.`updated_at` = '2024-12-08 09:47:51' where `id` = 7

    public function languages()
    {
        $languages = Language::whereNot('code', LanguageConst::NOT_REMOVABLE)->select("code", "name")->get()->toArray();
---
select `code`, `name` from `languages` where not `code` = 'en'