public_html/app/Http/Controllers/Admin/VendorController.php

select * from `vendors` limit 10 offset 0
select count(*) as aggregate from `vendors`
---
    public function index()
    {
        // Fetch all vendors with pagination
        $vendors = Vendor::paginate(10);

insert into `vendors` (`name`, `business_name`, `contact_number`, `address`, `sec_registration`, `bir_registration`, `dti_registration`, `updated_at`, `created_at`) values ('hello', 'hello', '023987', 'nmldnjs', 'vendors/x26wWYu3wsMGutkIoCHjwpbbZwnOXWS4pSPmHdwG.jpg', 'vendors/224LoeVliKjElCrxrnWNriPp6ASDcBrWQka6M4u2.jpg', 'vendors/45D8KmBqvb0uA2Pwso00yUofvIb7k1O4HdOpf0QS.jpg', '2024-12-07 16:21:10', '2024-12-07 16:21:10')
---
    public function store(Request $request)
    {
        // Validate incoming request data
        $request->validate([
            'name' => 'required|string|max:255',
            'business_name' => 'required|string|max:255',
            'contact_number' => 'required|string|max:15',
            'address' => 'required|string|max:255',
            'sec_registration' => 'required|file|mimes:pdf,jpg,png,jpeg|max:10240',
            'bir_registration' => 'required|file|mimes:pdf,jpg,png,jpeg|max:10240',
            'dti_registration' => 'required|file|mimes:pdf,jpg,png,jpeg|max:10240',
        ]);

        // Create the vendor instance
        $vendor = Vendor::create([
            'name' => $request->name,
            'business_name' => $request->business_name,
            'contact_number' => $request->contact_number,
            'address' => $request->address,
        ]);

select * from `vendors` where `vendors`.`id` = '15' limit 1
delete from `vendors` where `id` = 15
---
    public function destroy($id)
    {
        // Find the vendor by ID
        $vendor = Vendor::findOrFail($id);

        // Delete associated files from storage
        if ($vendor->sec_registration) {
            Storage::delete($vendor->sec_registration);
        }
        if ($vendor->bir_registration) {
            Storage::delete($vendor->bir_registration);
        }
        if ($vendor->dti_registration) {
            Storage::delete($vendor->dti_registration);
        }

        // Delete the vendor
        $vendor->delete();

update `vendors` set `sec_registration` = 'backend/images/vendors/ffwd_sec_registration.png', `bir_registration` = 'backend/images/vendors/ffwd_bir_registration.png', `dti_registration` = 'backend/images/vendors/ffwd_dti_registration.png', `vendors`.`updated_at` = '2024-12-07 16:52:19' where `id` = 18
---
    }

    // Save the updated vendor data
    $vendor->save();